Tekla.Structures.Model.SurfaceTreatment
The SurfaceTreatment class defines a layer above a building element defining what a surface looks like.
The surface could for example have a tiled look.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
ContourPlate cp = new ContourPlate();
cp.AddContourPoint(new ContourPoint(new Point( 6000,  6000,0),null));
cp.AddContourPoint(new ContourPoint(new Point( 9000,  6000,0),null));
cp.AddContourPoint(new ContourPoint(new Point( 9000, 12000,0),null));
cp.AddContourPoint(new ContourPoint(new Point(10500, 15000,0),null));
cp.AddContourPoint(new ContourPoint(new Point( 6000, 12000,0),null));
Contour c = new Contour();
c.AddContourPoint(new ContourPoint(new Point( 6000,  6000,5), null));
c.AddContourPoint(new ContourPoint(new Point( 9000,  6000,5), null));
c.AddContourPoint(new ContourPoint(new Point( 9000, 12000,5), null));
c.AddContourPoint(new ContourPoint(new Point(10500, 15000,5), null));
c.AddContourPoint(new ContourPoint(new Point( 7500, 12000,5), null));
cp.Insert();
SurfaceTreatment treatment = new SurfaceTreatment();
treatment.Father = cp;
treatment.Polygon = c;
treatment.StartPoint = new Point(1500,0000,0);
treatment.EndPoint = new Point(1500,6000,0);
bool Result = false;
Result = treatment.Insert();
}
}